{
    "d0": "реакт",
    "d1": "гайд по реакту",
    "d2": "реакт приложения",
    "d3": "тел.",
    "d4": "почта",
    "d5": "модал MUI",

    "p00": "React — JavaScript библиотека для создания пользовательских интерфейсов от Facebook. Она использует компоненты, декларативный подход и виртуальный DOM для эффективного обновления интерфейса. JSX позволяет писать HTML-подобный код в JavaScript. React популярен, имеет активное сообщество и широкий инструментарий.",
    "p01": "Узнай больше о react с нами",
    "p02": "React (иногда React.js или ReactJS) — JavaScript-библиотека с открытым исходным кодом для разработки пользовательских интерфейсов.\nReact разрабатывается и поддерживается Facebook, Instagram и сообществом отдельных разработчиков и корпораций.\nReact может использоваться для разработки одностраничных и мобильных приложений. Его цель — предоставить высокую скорость разработки, простоту и масштабируемость.\nВ качестве библиотеки для разработки пользовательских интерфейсов React часто используется с другими библиотеками, такими как MobX, Redux и GraphQL.",
    "p03": "Особенности:\n1. Однонаправленная передача данных:\nСвойства передаются от родительских компонентов к дочерним. Компоненты получают свойства как множество неизменяемых значений, поэтому компонент не может напрямую изменять свойства, но может вызывать изменения через callback-функции. Такой механизм называют «свойства вниз, события наверх».\n2. Виртуальный DOM:\nReact использует виртуальный DOM (англ. virtual DOM). React создаёт кэш-структуру в памяти, что позволяет вычислять разницу между предыдущим и текущим состояниями интерфейса для оптимального обновления DOM браузера. Таким образом программист может работать со страницей, считая, что она обновляется вся, но библиотека самостоятельно решает, какие компоненты страницы необходимо обновить.\n3. Redux:\nЧасто React используют в связке с Redux для управления состояниями компонентов JSX JavaScript XML (JSX) — это расширение синтаксиса JavaScript, которое позволяет использовать HTML-подобный синтаксис для описания структуры интерфейса. Как правило, компоненты написаны с использованием JSX, но также есть возможность использования обычного JavaScript. JSX напоминает другой язык, созданный в компании Фейсбук для расширения PHP, XHP.\n4. React Hooks:\nХуки позволяют использовать состояние и другие возможности React без написания классов. Построение пользовательских хуков позволяет помещать логику компонента в повторно используемые функции.",
    "p04": "official react site",
    "p05": "react wikipedia",

    "p10": "Для начала работы с react вам необходимо установить node.js.",
    "p11": "ссылка на node.js",
    "p12": "Для начала работы с react перейдите в консоли в директорию проекта и введите команду npm create vite. затем введите y, введите название проекта, выбирете фрэймворк react, выбирете язык (JS / TS) + SWC. Всё, ваш проект создан! для его запуска введите npm run dev.",
    "p13": "видеогайд по реакту",

    "p20": "Вы используете приложения React каждый день, просматривая любимые телешоу, просматривая социальные сети и проверяя электронную почту. Пришло время узнать, какие известные компании создали свои приложения с помощью ReactJS.",
    "p21": "Facebook",
    "p22": "Хотя частично, Facebook использует React js. Их веб-страница создана с помощью React, как скрипта, который встраивается в код приложения. Использование React на их веб-странице включает новостную ленту, профили, посты, комментарии, уведомления и другие интерактивные компоненты. Мобильное приложение также создано с помощью версии React под названием React Native, которая похожа, хотя и отвечает за отображение собственных компонентов iOS и Android вместо элементов DOM.",
    "p23": "Интересно, что Facebook был местом, где изначально была создана библиотека ReactJS, поэтому очевидно, что приложение будет ее использовать. React имеет яркое и активное сообщество, поддерживаемое Facebook и независимыми разработчиками. Это обширное сообщество предоставляет множество ресурсов, библиотек и инструментов, облегчая обмен знаниями и сотрудничество.",
    "p24": "Instagram",
    "p25": "Использование ReactJS в Instagram огромно. Доказательством этого являются многочисленные функции, включая геолокации, API Google Maps, точность поисковой системы, а также теги, которые выводятся без хэштегов. Все это есть в API этого приложения React — и это действительно впечатляет. Instagram полностью основан на библиотеке ReactJS и позволил фанатам полностью адаптироваться к своим удивительным функциям.",
    "p26": "Односторонний поток данных React обеспечивает предсказуемую структуру данных, что упрощает отладку и поддержку приложения. Это имеет решающее значение для Instagram, где согласованность и надежность данных имеют важное значение для бесперебойного пользовательского опыта. Instagram также выигрывает от оптимизации производительности React. Использование Virtual DOM и рендеринга на стороне сервера гарантирует, что динамический контент Instagram загружается быстро и плавно, улучшая пользовательский опыт.",
    "p27": "см. другие приложения React"
}
